<center><H1 style="color: green">LOAN PREDICTION ANALYSIS</H1></center>

Company wants to automate the loan eligibility process (real time) based on customer detail provided while filling online application form. These details are Gender, Marital Status, Education, Number of Dependents, Income, Loan Amount, Credit History and others. To automate this process, they have given a problem to identify the customers segments, those are eligible for loan amount so that they can specifically target these customers.

### Import necessary Libraries

In [1]:
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import warnings

In [2]:
warnings.filterwarnings('ignore')

### Load the files

In [3]:
df=pd.read_csv('LOAN.csv')

In [4]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

#### Do data analysis with the dataset ( shape of dataset,columns,null objects,unique elements)

#### Shape

In [5]:
df.shape

(614, 13)

#### Columns

In [6]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

#### Number of null objects in each column

In [7]:
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [8]:
df['Gender']=df['Gender'].fillna(method='bfill')
df['Dependents']=df['Dependents'].fillna(method='bfill')
df['Self_Employed']=df['Self_Employed'].fillna(method='bfill')

In [9]:
df['Self_Employed'].unique()

array(['No', 'Yes'], dtype=object)

In [10]:
df.fillna(df['LoanAmount'].mean(),inplace=True)
df.fillna(df['Loan_Amount_Term'].mean(),inplace=True)
df.fillna(df['Credit_History'].mean(),inplace=True)

In [11]:
df.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [12]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,146.412162,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.000000,360.0,1.0,Urban,Y

In [13]:
df['LoanAmount'].unique()

array([146.41216216, 128.        ,  66.        , 120.        ,
       141.        , 267.        ,  95.        , 158.        ,
       168.        , 349.        ,  70.        , 109.        ,
       200.        , 114.        ,  17.        , 125.        ,
       100.        ,  76.        , 133.        , 115.        ,
       104.        , 315.        , 116.        , 112.        ,
       151.        , 191.        , 122.        , 110.        ,
        35.        , 201.        ,  74.        , 106.        ,
       320.        , 144.        , 184.        ,  80.        ,
        47.        ,  75.        , 134.        ,  96.        ,
        88.        ,  44.        , 286.        ,  97.        ,
       135.        , 180.        ,  99.        , 165.        ,
       258.        , 126.        , 312.        , 136.        ,
       172.        ,  81.        , 187.        , 113.        ,
       176.        , 130.        , 111.        , 167.        ,
       265.        ,  50.        , 210.        , 175.        ,
       131.        , 188.        ,  25.        , 137.        ,
       160.        , 225.        , 216.        ,  94.        ,
       139.        , 152.        , 118.        , 185.        ,
       154.        ,  85.        , 259.        , 194.        ,
        93.        , 370.        , 182.        , 650.        ,
       102.        , 290.        ,  84.        , 242.        ,
       129.        ,  30.        , 244.        , 600.        ,
       255.        ,  98.        , 275.        , 121.        ,
        63.        , 700.        ,  87.        , 101.        ,
       495.        ,  67.        ,  73.        , 260.        ,
       108.        ,  58.        ,  48.        , 164.        ,
       170.        ,  83.        ,  90.        , 166.        ,
       124.        ,  55.        ,  59.        , 127.        ,
       214.        , 240.        ,  72.        ,  60.        ,
       138.        ,  42.        , 280.        , 140.        ,
       155.        , 123.        , 279.        , 192.        ,
       304.        , 330.        , 150.        , 207.        ,
       436.        ,  78.        ,  54.        ,  89.        ,
       143.        , 105.        , 132.        , 480.        ,
        56.        , 159.        , 300.        , 376.        ,
       117.        ,  71.        , 490.        , 173.        ,
        46.        , 228.        , 308.        , 236.        ,
       570.        , 380.        , 296.        , 156.        ,
       103.        ,  45.        ,  65.        ,  53.        ,
       360.        ,  62.        , 218.        , 178.        ,
       239.        , 405.        , 148.        , 190.        ,
       149.        , 153.        , 162.        , 230.        ,
        86.        , 234.        , 246.        , 500.        ,
       186.        , 119.        , 107.        , 209.        ,
       208.        , 243.        ,  40.        , 250.        ,
       311.        , 400.        , 161.        , 196.        ,
       324.        , 157.        , 145.        , 181.        ,
        26.        , 211.        ,   9.        , 205.        ,
        36.        ,  61.        , 146.        , 292.        ,
       142.        , 350.        , 496.        , 253.        ])

### Convert Loan status to numerical values

In [14]:
def gen(x):
    if x=='Y':
        return 1
    elif x=='N':
        return 0
df['loan_status']=df['Loan_Status'].apply(gen)

In [15]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,loan_status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,146.412162,360.0,1.0,Urban,Y,1
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.000000,360.0,1.0,Rural,N,0
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.000000,360.0,1.0,Urban,Y,1
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.000000,360.0,1.0,Urban,Y,1
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.000000,360.0,1.0,Urban,Y,1

In [16]:
df.drop(columns=['Loan_ID','Married','Loan_Status'],axis=1,inplace=True)

In [17]:
df.drop(0,inplace=True)

In [18]:
df['Gender'].unique

<bound method Series.unique of 1        Male
2        Male
3        Male
4        Male
5        Male
        ...
609    Female
610      Male
611      Male
612      Male
613    Female
Name: Gender, Length: 613, dtype: object>

In [19]:
def gen(x):
    if x=='Male':
        return 0
    elif x=='Female':
        return 1
df['gender']=df['Gender'].apply(gen)
df.drop(columns=['Gender'],inplace=True)

df.tail()

,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,loan_status,gender
609,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,1,1
610,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,1,0
611,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,1,0
612,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,1,0
613,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,0,1

In [20]:
df.dtypes

Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
loan_status            int64
gender                 int64
dtype: object

In [21]:
df.isnull().sum()

Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
loan_status          0
gender               0
dtype: int64

In [22]:
df1=df.drop(columns=['ApplicantIncome','loan_status'])
frames=[df['ApplicantIncome'],df['loan_status']]
df2=pd.concat(frames,axis=1)
df1.head()

,Dependents,Education,Self_Employed,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,gender
1,1,Graduate,No,1508.0,128.0,360.0,1.0,Rural,0
2,0,Graduate,Yes,0.0,66.0,360.0,1.0,Urban,0
3,0,Not Graduate,No,2358.0,120.0,360.0,1.0,Urban,0
4,0,Graduate,No,0.0,141.0,360.0,1.0,Urban,0
5,2,Graduate,Yes,4196.0,267.0,360.0,1.0,Urban,0

In [23]:
new_df=pd.get_dummies(df1,drop_first=True)

In [24]:
new_df.head()

,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,gender,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban
1,1508.0,128.0,360.0,1.0,0,1,0,0,0,0,0,0
2,0.0,66.0,360.0,1.0,0,0,0,0,0,1,0,1
3,2358.0,120.0,360.0,1.0,0,0,0,0,1,0,0,1
4,0.0,141.0,360.0,1.0,0,0,0,0,0,0,0,1
5,4196.0,267.0,360.0,1.0,0,0,1,0,0,1,0,1

In [25]:
frame=[new_df,df2]
df=pd.concat(frame,axis=1)
df.head()

,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,gender,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban,ApplicantIncome,loan_status
1,1508.0,128.0,360.0,1.0,0,1,0,0,0,0,0,0,4583,0
2,0.0,66.0,360.0,1.0,0,0,0,0,0,1,0,1,3000,1
3,2358.0,120.0,360.0,1.0,0,0,0,0,1,0,0,1,2583,1
4,0.0,141.0,360.0,1.0,0,0,0,0,0,0,0,1,6000,1
5,4196.0,267.0,360.0,1.0,0,0,1,0,0,1,0,1,5417,1

In [26]:
X=df.drop(columns=['loan_status'])
y=df['loan_status']

In [27]:
from sklearn.preprocessing import StandardScaler

In [28]:
scalar=StandardScaler()

In [29]:
X_scaled=scalar.fit_transform(X)

In [30]:
X=pd.DataFrame(X_scaled,columns=X.columns)
X.head()

,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,gender,Dependents_1,Dependents_2,Dependents_3+,Education_Not Graduate,Self_Employed_Yes,Property_Area_Semiurban,Property_Area_Urban,ApplicantIncome
0,-0.039614,-0.219095,0.318249,-0.294031,-0.475395,2.212291,-0.454635,-0.301243,-0.528913,-0.403965,-0.783044,-0.698473,-0.134184
1,-0.555079,-0.956861,0.318249,-0.294031,-0.475395,-0.452020,-0.454635,-0.301243,-0.528913,2.475461,-0.783044,1.431695,-0.393309
2,0.250933,-0.314290,0.318249,-0.294031,-0.475395,-0.452020,-0.454635,-0.301243,1.890668,-0.403965,-0.783044,1.431695,-0.461569
3,-0.555079,-0.064402,0.318249,-0.294031,-0.475395,-0.452020,-0.454635,-0.301243,-0.528913,-0.403965,-0.783044,1.431695,0.097768
4,0.879199,1.434929,0.318249,-0.294031,-0.475395,-0.452020,2.199567,-0.301243,-0.528913,2.475461,-0.783044,1.431695,0.002335

In [31]:
df.isnull().sum()

CoapplicantIncome          0
LoanAmount                 0
Loan_Amount_Term           0
Credit_History             0
gender                     0
Dependents_1               0
Dependents_2               0
Dependents_3+              0
Education_Not Graduate     0
Self_Employed_Yes          0
Property_Area_Semiurban    0
Property_Area_Urban        0
ApplicantIncome            0
loan_status                0
dtype: int64

In [32]:
from sklearn.model_selection import train_test_split

In [33]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=100,shuffle=True)

In [34]:
X_train.shape

(490, 13)

In [35]:
y_train.shape

(490,)

In [36]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import GridSearchCV
from  sklearn import metrics
from sklearn.model_selection import cross_val_score

In [37]:
cross_val_score(RandomForestClassifier(),X,y,cv=5,scoring='accuracy').mean()

0.7912701586032254

In [38]:
param={'n_estimators':list(range(1,50)),'criterion':['gini','entropy'],'max_depth':[None,1,2,3]}

In [39]:
gv=GridSearchCV(RandomForestClassifier(),param,cv=5,scoring='accuracy')
gv

GridSearchCV(cv=5, estimator=RandomForestClassifier(),
             param_grid={'criterion': ['gini', 'entropy'],
                         'max_depth': [None, 1, 2, 3],
                         'n_estimators': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,
                                          13, 14, 15, 16, 17, 18, 19, 20, 21,
                                          22, 23, 24, 25, 26, 27, 28, 29, 30, ...]},
             scoring='accuracy')

In [40]:
gv.fit(X_train,y_train)

GridSearchCV(cv=5, estimator=RandomForestClassifier(),
             param_grid={'criterion': ['gini', 'entropy'],
                         'max_depth': [None, 1, 2, 3],
                         'n_estimators': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12,
                                          13, 14, 15, 16, 17, 18, 19, 20, 21,
                                          22, 23, 24, 25, 26, 27, 28, 29, 30, ...]},
             scoring='accuracy')

In [41]:
pred=gv.predict(X_test)

In [42]:
metrics.accuracy_score(y_test,pred)

0.7642276422764228

In [43]:
print('Confusion matrix of the model is:')
print(metrics.confusion_matrix(y_test,pred))
print('Classification report of the model is:')
print(metrics.classification_report(y_test,pred))

Confusion matrix of the model is:
[[13 27]
 [ 2 81]]
Classification report of the model is:
              precision    recall  f1-score   support

           0       0.87      0.33      0.47        40
           1       0.75      0.98      0.85        83

    accuracy                           0.76       123
   macro avg       0.81      0.65      0.66       123
weighted avg       0.79      0.76      0.73       123

In [44]:
import pickle

### Save the trained Model

In [45]:
filename='loanmodel.sav'

In [46]:
pickle.dump(gv,open(filename,'wb'))

### Load saved Model

In [47]:
loaded_model=pickle.load(open('loanmodel.sav','rb'))